{
  "AC-04": "- Develop and categorize a system which determines the information flow within the organization, for essential and non-essential data.\n- Create strict access rules to control the information flow. Apply them based on roles, responsibilities and the need for information.\n- Integrate mechanisms in the system to monitor, control, and protect the flow of information to prevent unauthorized access, modification, and transfer.\n- Regularly review and update the rules and enforcement mechanisms to address changes in roles, responsibilities and threats.",
  "CA-07": "• Establish a continuous monitoring system in your organization that regularly checks the security controls in place.\n• Develop a continuous monitoring plan outlining the frequency of assessment and methods of gathering system information.\n• Regularly generate and review reports on the status and effectiveness of the controls in the system, noting any risks or weaknesses.\n• Adjust and update security controls as needed, using results from the monitoring system. Keep all stakeholders informed about changes.",
  "CM-02": "- Establish a standardized baseline configuration: Detail the essential software, settings, and security configurations that every system must adhere to.\n- Document the baseline configuration: Create formal documentation of settings, configurations, and changes. Ensure that it's readily available for review and update.\n- Implement Baseline Configuration: Deploy the documented baseline configuration across all systems. Use automation wherever possible to ensure uniformity. \n- Monitor and Enforce Compliance: Regularly review system configurations to ensure they align with the baseline. Use automated configuration management tools alongside routine audits.",
  "CM-06": "• Establish and document a standard secure network configuration policy, defining configuration settings for hardware and software.\n• Implement automated tools to monitor, track, and report changes in configurations in line with NIST SP 800-53 guidelines.\n• Regularly evaluate the effectiveness of this policy and revise if necessary, and educate staff about configuration settings and change management protocol.\n• Back-up configurations and introduce a process to recover to an established configuration in case of disruption or failure.",
  "SC-07": "• Install and configure firewalls, routers, and Intrusion Prevention Systems (IPS) to control and monitor traffic at the system boundary.\n• Implement network architecture that separates internal networks from public networks, creating a DMZ for public-facing applications.\n• Apply encryption for all data transmission crossing the system boundaries to ensure data privacy.\n• Regularly review and update security policies to adapt to emerging threats and to ensure compliance with SC-07 standards.\n• Arrange for continuous monitoring and detection to identify and respond to suspicious activities.",
  "SI-03": "• Install and maintain up-to-date antivirus software: Ensure all devices use antivirus software and frequently update it to protect against the latest threats.\n• Enable automatic scans: Set up antivirus software to automatically scan files upon access and routinely scan all system files.\n• Limit User Privileges: Limit software installation rights and execution of unknown programs to reduce the potential attack surface.\n• Implement Web Filtering: Set up a web filter to block access to known malicious sites. Regularly update the database to ensure thorough protection.",
  "SI-04": "• Install and configure a system monitoring tool that aligns with NIST SP 800-53 control SI-04. Ensure the tool will monitor data events, network traffic, system configurations and detect anomalies.\n• Develop clear policies on auditing and monitoring procedures including monitoring scope, frequency and responsibilities.  \n• Regularly review the system monitoring records and reports to analyze for potential security threats and violations.\n• Implement a system alert structure that notifies key personnel of critical system events or suspicious activities promptly.",
  "AC-16": "• Step 1: Identify and document all security and privacy attributes linked to each user role in your organization, this can include access privileges, data handling, and confidentiality levels.\n• Step 2: Implement a standardized process or system that assigns and updates these attributes for each user based on their role.\n• Step 3: Create a user verification method, such as a login system, that utilizes these attributes to grant or restrict access.\n• Step 4: Establish an ongoing review and update process for these attributes, ensuring they track job roles and responsibilities changes.",
  "AC-02": "•\tStart by identifying and documenting the roles of all users within the system, along with their corresponding access rights.\n•\tEstablish a regular review schedule and process for auditing user privileges to ensure that inappropriate or excess rights aren't perpetuated.\n•\tImplement an automated system to handle account creation, modification, enabling, disabling, and removal based on user's role and status.\n•\tCreate a process for granting and adjusting user privileges during changes in users' roles, transfer, or termination.",
  "AC-03": "• Identify and categorize information systems according to data type and sensitivity.\n• Develop and implement an access policy that determines who is allowed to access specific types of information.\n• Use tools for automated access enforcement, such as password protection and encryption, being sure to configure them according to your access policy.\n• Regularly review and update your access policy and enforcement methods, especially following personnel changes or security incidents.",
  "AC-05": "• Define roles and responsibilities: Identify various tasks in your organization and assign them to different roles ensuring that sensitive tasks are divided to prevent misuse.\n• Implement access controls: Set up a system for granting access to resources based on roles. Use a privileges approach where users receive only the necessary permissions for their jobs.\n• Regular audits: Continually monitor and audit access permissions to detect anomalies and reassess roles regularly.\n• Use automation: Leverage automation tools to implement, manage, and audit separation of duties effectively.",
  "AC-06": "• Identifying required user privileges for each system function and limiting that to the minimal necessity for each user role.\n• Implement a comprehensive access control system which periodically reviews and updates user access privileges.\n• Set up secure system alerts for any attempts at bypassing user access limits.\n• Train employees on the significance of maintaining the least privilege principle, focusing on potential security risks.",
  "CM-05": "• Review and document all system components that allow changes to occur. Includes software, hardware and environmental elements.\n• Develop a strict access control policy that defines roles and permissions for those who can implement changes. Only trusted and authorized personnel should have these permissions.\n• Implement a secure method for granting and revoking change permissions. This may involve multifactor authentication or secure remote access tools.\n• Regularly review and update the access control policy and associated systems to identify and respond to security vulnerabilities.",
  "CM-07": "• Step 1: Itemize all software, functionalities, and services running in your system environment.\n• Step 2: Review and assess each service for its absolute necessity for system operations.\n• Step 3: Deactivate or uninstall any non-essential services, functionalities or components of system software.\n• Step 4: Regularly update this control process, as new system updates can sometimes reinstate previously deactivated services.",
  "CP-09": "• Step 1: Identify all critical data and system components that require backup. This includes databases, application servers, and essential documents.\n• Step 2: Develop and implement a regular backup schedule. The frequency should be based on the importance of the data and the regulatory requirements.\n• Step 3: Store backups in a secure, offsite location to protect against local disasters. Encryption should be applied for extra safety.\n• Step 4: Perform regular test restores to ensure the viability of the backup data and effectiveness of the restoration process.",
  "IA-02": "• Step 1: Implement User Identity Management by making sure each user has a unique ID that is determined by verification of user-specific information (like name, DOB, address, etc.).\n\n• Step 2: Authentication Mechanism Enforcement; Ensure the organizational system is capable to enforce multi-factor authentication, where required. The system must also be resilient against common methods of spoofing credentials.\n\n• Step 3: Implement session control measures to detect and handle abnormal repetitive login attempts, make sure the session locks after a period of inactivity, and there is a session termination process.\n\n• Step 4: Management of Identifier and Authenticator Lifetimes; regular identifiers and authenticators reviews and updates must take place.",
  "IA-04": "• Initially, establish unique identifiers for each user to ensure individual accountability.\n• Implement a secure system to manage these identifiers, including assignment, status changes, and revocation. Use automated systems to reduce errors and manage large numbers of identifiers.\n• Regularly review identifier management system to identify inactive users or inconsistencies.\n• When a user's employment or access status changes, immediately modify or revoke their identifier to prevent unauthorized access.",
  "IA-05": "• Step 1: Develop and implement a policy that mandates periodic change and management of authenticators (passwords, tokens, etc.).\n• Step 2: Ensure that every user generates strong and unique authenticators that cannot be easily guessed (using special characters, numerals, etc.)\n• Step 3: Make sure that the authenticators are encrypted when stored or transmitted, to prevent unauthorized access.\n• Step 4: Implement a system that monitors and identifies any unauthorized access or attempts to guess or crack authenticators.",
  "SC-28": "• Identify and classify all information at rest needing protection based on sensitivity and criticality.\n• Implement encryption for all identified sensitive data at rest using protocols such as Advanced Encryption Standard (AES) or others meeting FIPS 140-2 standards.\n• Establish robust access controls, limiting privileged access to this information and regularly reviewing these permissions.\n• Regularly audit and monitor data access and usage, and conduct vulnerability assessments to ensure the effectiveness of implemented security measures.",
  "SC-39": "•\tStart by establishing and implementing a system process that isolates the users or services running in different security domains.\n•\tDesign and configure your system to prohibit and restrict the communication paths among the processes.\n•\tPeriodically review and update your process isolation procedures as security requirements or functions changes. Ensure all changes are well documented.\n•\tRoutinely conduct process isolation tests to verify their effectiveness and make improvements as needed.",
  "SI-12": "• Establish and document policies and procedures in line with NIST SP 800-53 SI-12 standards for information management and retention, including how long and where data should be stored.\n• Implement systems, tools, or modules that assist in automating the store, retrieval, and deletion of data according to dictated policies.\n• Regularly monitor and review compliance with these policies, updating them as necessary to reflect operational or regulatory changes. \n• Train and educate all members of your organization regarding these policies to ensure full awareness and compliance.",
  "SI-02": "- Identify and Prioritize: Use vulnerability scanning tools to identify system flaws periodically. Prioritize critical flaws, based on potential impact and ease of exploitation.\n- Patch Management: Implement a patch management process to apply necessary patches or upgrades to software/hardware. Follow vendor guidelines while applying patches.\n- Verify: Post-remediation, verify system functionality and integrity. Ensure the system is operating as intended.\n- Document: Maintain a record of all flaws and remediation activities for future reference and compliance audits.",
  "SI-07": "- Step 1: Conduct regular integrity checks on software and firmware by applying tools such as File Integrity Monitors (FIM).\n- Step 2: Establish and utilize a centralized patch management system to ensure that all software and firmware are consistently updated and patched.\n- Step 3: Implement cryptographic hashes to check the integrity of downloaded data or transferred data.\n- Step 4: Put clear procedures in place for employees to respond to integrity violations, suspicious activity, or detected vulnerabilities in software and firmware.",
  "AC-17": "• Establish policies for remote access, ensuring it integrates security standards set out in AC-17 and only the necessary individuals and roles have remote access privileges.\n• Implement two-factor authentication for all remote access to provide an additional layer of security.\n• Monitor all remote access activities regularly and ensure logging is in place for audit purposes.\n• Use secure and encrypted connection protocols (e.g., SSL, HTTPS, VPN) for remote access.",
  "CM-08": "• Develop a detailed inventory of all system components within the organization, including hardware and software. Keep it regularly updated.\n• Implement automated tools to track the changes and status of all the components.\n• Record details of each component like version, functionality, and updates.\n• Perform a regular review on the inventory to validate its accuracy and verify unauthorized changes.",
  "RA-05": "• Implement and regularly update a comprehensive vulnerability scanning tool to monitor your networks and systems for potential threats.\n• Schedule routine scans, ideally in different intervals including monthly, quarterly, and annually, to ensure constant monitoring.\n• Analyze scan results to identify, categorize, and prioritize vulnerabilities based on risk levels.\n• Develop remediation plans to address identified vulnerabilities. Roll out necessary patches and monitor for effective implementation.",
  "SC-18": "• Establish a policy restricting the usage of mobile code and defining authorized and unauthorized mobile code technologies.\n• Utilize security tools to monitor and control mobile code execution in organizational systems. \n• Regularly update and patch mobile code, development environments and hosting environments to protect against new threats.\n• Provide training to employees about the security risks associated with running unauthorized mobile code.",
  "SC-03": "• Evaluate your current IT configuration to identify system components that perform security functions.\n• Isolate these security function components from non-security function components using physical or logical separations. This could involve deploying firewalls or creating subnetworks.\n• Regularly review and update the isolation measures, to ensure any changes to system components or their functions are addressed.\n• Implement security measures to protect communication paths between isolated components, such as encryption.",
  "SC-46": "• Develop policies and controls that explicitly define accessibility parameters across multiple domains.\n• Install comprehensive security solutions added with cross-domain capabilities to ensure policy enforcement across distinct network domains.\n• Regularly monitor and analyze logs for unauthorized or suspicious cross-domain activities, adjusting security measures as necessary.\n• Regularly revise and upgrade cross-domain policies to keep up with the ever-evolving landscape of cybersecurity threats and vulnerabilities.",
  "AC-20": "• Develop clear procedures: Procedures and policies should be put in place to dictate how external systems can be accessed and used. These policies should also detail potential risks.\n\n• User Training: All users must be educated on what counts as an external system and the correct procedures for using these systems safely.\n\n• Implement necessary security measures: Use firewalls, VPNs, and strong passwords to regulate access to external systems.\n\n• Regular audits: External system usage should regularly be audited for unusual or prohibited behavior. This allows for quick issue detection and solution implementation.",
  "AC-07": "• Set a policy that limits the number of unsuccessful logon attempts within a defined time period. This limit may vary depending on your need.\n• Implement a system function that locks the user account after the policy limit on logon attempts has been reached.\n• Configure the lockout for a specific time period. After this period has passed, the user account should unlock automatically.\n• Ensure proper monitoring and notification system is in place for administrators to review and respond to the logon attempts.",
  "CA-08": "• Identify the system boundary and critical assets: Evaluate what your organization's most important information assets are and determine the boundary of the system to be tested.\n• Develop a penetration testing plan: Outline the testing methodologies, tools, and specific tests to be used. Identify who will perform the test.\n• Conduct Penetration Testing: According to the plan, run penetration tests which mimic real-world attacks to identify vulnerabilities.\n• Document and remediate findings: Document all identified vulnerabilities and develop a remediation plan. Re-test as necessary after remediation efforts are implemented.",
  "CM-11": "• Develop a policy restricting unapproved software installation, ensuring all users are aware of it and enforcing penalties for violation.\n• Use software inventory management tools to regularly monitor and account for all installed software. Verify if each is necessary and meets security requirements.\n• Implement automated controls to prevent unauthorized software installation - this might be through administrator permission settings or by using enterprise mobility management systems.\n• Conduct regular audits to ensure compliance and update policies as needed.",
  "CM-03": "• Step 1: Establish a configuration change control policy defining structured processes for requesting, approving, implementing, and documenting hardware and software modifications.\n• Step 2: Incorporate automated systems that detect and manage changes, ensuring they align with the set policy.\n• Step 3: Periodically review and analyze system changes, ensuring that all changes are authorized, documented, and don't pose any security risks.\n• Step 4: Train your team in the change control process, ensuring uniform policy adherence and a secure work environment.",
  "IA-06": "• Configure systems to withhold specific authentication error details from the user interface. Display non-descriptive error messages that only indicate the authentication was unsuccessful.\n• Update all system/session logs to capture comprehensive details about failed/passed authentication events for internal use.\n• Subject this implementation to regular audits and updates to ensure it functions correctly.\n• Conduct rigorous user training about recognizing an authentic system response, teaching them not to expect specific error/success prompts.",
  "SI-10": "• Install and configure an input validation solution, focusing on user inputs to web forms, file uploads, and network parameters, to check for any malicious data.\n• Regularly update the validation rules/algorithm to keep up with new potential security threats.\n• Create a process to verify that any changes in system config or software don't negatively affect validation rules.\n• Conduct regular audits of the input validation process to ascertain efficiency and to identify any overlooked vulnerabilities.",
  "SI-15": "• Install a robust filtering software that can examine information output for potential threats such as viruses, malware, or sensitive data leaks. \n\n• Establish filtering criteria that are in line with your organization's policies and industry regulations. Update and refine these criteria periodically.\n\n• Schedule regular filter scans and configure the software to provide alerts for any breaches or threat detections.\n\n• Review filter logs regularly to identify any potential trends or vulnerabilities and take corrective action promptly. Regularly test and evaluate filters for threats.",
  "AC-23": "• Develop and implement a Data Mining Protection Policy, in alignment with the NIST SP 800-53 guidelines. Include detailed processes to protect against unsanctioned data mining.\n• Apply strict access controls to data resources, ensuring only authorized personnel can access and retrieve data. \n• Implement intrusion detection software to monitor for any suspicious activities or patterns indicative of data mining.\n• Schedule routine audits to ensure systems compliance with the control and data mining protection policy, and adjust policies as needed.",
  "CM-12": "• Evaluate your existing information systems assets to pinpoint precise physical and logical locations.\n• Utilize automated inventory tools to keep an updated record of the information systems and their specific locations.\n• Establish mechanisms to ensure real-time updates to the systems location information when changes occur.\n• Conduct regular reviews and audits of the information location data to ensure accuracy and validity in accordance with NIST SP 800-53 guidelines.",
  "MP-07": "• Develop and document policies around acceptable media use, based on NIST SP 800-53 guidelines.\n• Implement strict access controls to limit the handling and use of storage and digital media to authorized personnel only.\n• Implement procedures to maintain a log of all activities involving media, including media carrying sensitive information.\n• Regularly update and reinforce the media use policy through training workshops to ensure employees understand and adhere to the rules.",
  "SA-08": "• Develop and implement security and privacy engineering principles within your organization. Ensure they are integrated into every aspect of product or system lifecycle, from design, development, to disposal.\n• Continuously perform risk assessments on all systems to identify any potential security and privacy risks.\n• Conduct regular training for all involved personnel to ensure understanding and application of these principles.\n• Establish procedures to monitor compliance with these principles and to address any identified shortcomings or violations.",
  "SC-13": "• Step 1: Document all data that needs encryption, specifying the categories it falls under. \n• Step 2: Select and implement a robust cryptography method that meets NIST standards. Typically, AES (Advanced Encryption Standard) is recommended. \n• Step 3: Encrypt the data in transit and at rest using the selected standard, ensuring that all sensitive and confidential data is protected. \n• Step 4: Regularly inspect and update the encryption methods and keys as part of your cybersecurity strategy. This helps ensure the ongoing safety of your data.",
  "SC-38": "• Step 1: Define and document roles and responsibilities associated with operation security and ensure all personnel are adequately trained.\n• Step 2: Implement and configure security systems such as firewalls, malware protection, and intrusion detection systems according to the agency's defined security policy and risk assessment.\n• Step 3: Regularly update and patch all system components and software as soon as updates become available.\n• Step 4: Establish a routine audit process to assess the effectiveness of operation security controls and make necessary improvements.",
  "SC-41": "• Identify all I/O devices and ports in your environment that can be accessed both physically and remotely.\n• Implement strict access controls and policies for identified I/O devices and ports to limit usage only to authorized personnel.\n• Design and deploy physical and software-based protective measures like firewalls and port-locking applications.\n• Regularly monitor and audit I/O device and port access events to ensure compliance with the policy, updating access controls as needed.",
  "IA-09": "• Establish a policy for the service identification and process authentication. Clearly define the identification and requirement parameters. \n• Implement multi-factor or strong authentication processes for all services within the system to ensure validity of users. \n• Employ automated tools to monitor and control service access and usage, ensuring identifiable access points.\n• Regularly review and update this setup to maintain an effective authentication scheme, conducting system audits periodically as part of this process.",
  "CA-03": "• Identify all mechanisms of information exchange, including systems, personnel, and processes in your organization.\n• Establish and enforce security controls for the aforementioned mechanisms, based on the policies detailed in NIST SP 800-53 CA-03.\n• Implement strong encryption practices for all forms of information exchange, especially over insecure networks.\n• Regularly monitor and audit the practices for proper adherence, and adjust controls as necessary to meet emerging threats and risks.",
  "SA-09": "• First, identify all external system services utilized in your organization, with a specific focus on information systems.\n• Then, establish and implement a security policy covering how you acquire, protect, and manage external services.\n• Regularly conduct security assessments of these services through a vetting process that evaluates their risk and compliance with your security controls.\n• Finally, implement a contract review process to validate that security requirements are addressed and met by the external system service providers.",
  "SC-31": "- Identify Potential Covert Channels: Start by making a list of potential data communication paths that could function as covert channels in your IT systems.\n- Conduct Analysis: Use digital forensics tools to analyze these potential covert channels for any hidden or abnormal data transfer activities.\n- Develop Mitigation Strategies: Establish methods to minimize the data bandwidth of the covert channels, limit unexpected communications, and/or detect abnormal behaviors early.\n- Regular Monitoring and Review: Schedule routine assessments to ensure your mitigation strategies are functioning effectively and update them as necessary.",
  "SR-04": "• Begin by identifying and cataloging all information types within your systems to understand the nature and sensitivity of data.\n• Implement robust data management systems that can track and securely store source and movement of information.\n• Set up automatic logging systems for capturing and updating provenance data every time information is handled or transmitted.\n• Regularly review these logs to ensure their effectiveness, troubleshoot any irregularities and update protective measures as needed.",
  "IA-08": "• Start by identifying all non-organizational users accessing your system, such as vendors, partners or contractors.\n• Develop a unique identification method for these users that complies with IA-08 requirements, such as two-factor authentication processes.\n• Implement a policy requiring validation of non-organizational users' identities before each system access.\n• Regularly audit and review the authentication process for any irregularities or potential breaches.",
  "SI-16": "• Deploy technologies, such as Address Space Layout Randomization (ASLR) and Data Execution Prevention (DEP), to protect memory spaces from unauthorized access.\n• Configure operating systems and applications to use these memory protection methods.\n• Regularly update all systems, applications, and protection tools for the latest security patches.\n• Monitor regularly and review system logs to detect any potential unauthorized attempts at bypassing memory protections.",
  "SR-11": "• Start by conducting an inventory of your organization's components, both software and hardware, to ensure you know what needs to be authenticated.\n• Implement a system to audit and verify the integrity and authenticity of your components. This could involve comparing SKU numbers, serial numbers, and other relevant data against manufacturer standards.\n• Regularly update your verification systems, taking into account new purchases and software updates. Ensure these are also authentic.\n• Define consequences for discrepancies found during the authenticity verification process such as immediate replacement or removal from the network until validated.",
  "SR-05": "• Assess current state: Examine your current acquisition process for data systems to identify shortcomings and threats.\n• Strategic Purchasing: Implement a strategy for purchasing that aligns with the NIST SP 800-53 SR-05 control. This means procuring systems with sufficient security functions.\n• Validate Tools: Ensure the tools acquired for cybersecurity meet their specified requirements and are capable of delivering the intended security services.\n• Employee Training: Train your staff to effectively apply and understand your data system's security operations to prevent potential threats.",
  "SR-06": "• Initiate a thorough review of the supplier's cybersecurity practices and confirm they adhere to recognized standards.\n• Execute an assessment of the supplier's data security systems, software, and overall practices to uncover any weaknesses or vulnerabilities.\n• Periodically review the supplier's ongoing compliance to ensure that their adherence to security standards remains consistent and any changes do not introduce unnecessary risk.\n• Establish a process for resolving any supplier-related security issues and ensuring all necessary measures are undertaken.",
  "AC-18": "- Install firewalls and intrusion detection systems on all devices using wireless access. This helps protect the network from potential threats.\n- Authenticate all devices before allowing access to the wireless network. This can be done using advanced authentication methods like two-factor and certificate-based authentication.\n- Regularly update wireless access devices' software and firmware to ensure up-to-date security features.\n- Do regular network audits to detect breaches and ensure that all wireless security controls are functioning as intended.",
  "AC-19": "- Develop and implement a mobile device management policy. This policy should define types of devices allowed, enable remote wiping, and enforce strong PINs and biometric identification.\n- Install trustable Mobile Device Management (MDM) software to oversee devices remotely. This will assist in maintaining operating system updates, and controlling application installations.\n- Configure access control mechanisms. Control access to organizational resources, and limit data storage and transfer capabilities, based on user roles and device status.\n- Regularly audit mobile devices for adherence to policy, checking compliance with updates and appropriate security configurations.",
  "CP-06": "• Identify a suitable alternate storage site that meets the security requirements of your organization.\n• Regularly backup and store important data and information at the chosen alternate storage site.\n• Implement tools and measures to ensure the security, authenticity, and integrity of the stored data.\n• Regularly test and maintain the alternate storage site to guarantee its functionality and reliability in the event of an emergency.",
  "CP-07": "• Identify feasible alternate processing sites for your organization's system operations.\n• Engage in formal agreements with selected alternate site providers, defining roles, responsibilities, and operational specifics.\n• Regularly test the effectiveness and readiness of the alternate site, including data recovery and seamless technology integration.\n• Document this entire process and maintain updated records so that in an emergency, system operations can shift without significant interruptions.",
  "SC-36": "• Perform an analysis of your system to identify components of distributed processing and storage. \n• Develop comprehensive procedures and configurations to ensure integrity, confidentiality, and availability of data during processing and storage.\n• Implement suitable encryption methods for data during transit and at rest, such as AES-256 for stringent security.\n• Regularly audit these components for any vulnerabilities or anomalies, and remedy detected issues promptly. Functions should adhere to the established security policies.",
  "SC-04": "• Begin by identifying all shared system resources including files, directories, memory, and peripheral devices.\n• Set up access controls for these shared resources, determining who should have access and the level of their privileges.\n• Implement a monitoring system to keep track of all access and modification attempts.\n• Regularly review and update these permissions to avoid unauthorized information access due to changes in roles or responsibilities.",
  "SI-23": "• Implement network devices or software that supports data fragmentation and encrypts fragmented parts during transmission, such as VPNs or secure file transfer protocols.\n• Regularly review and update the system's data fragmentation configurations to match the values defined in your organization's security policy.\n• Train and inform your personnel about the importance of information fragmentation and how it contributes to data security.\n• Regularly test and evaluate the effectiveness of your information fragmentation processes, making adjustments as needed for optimal security.",
  "SC-10": "• Step 1: Identify and document all network connections, including both local and remote.\n• Step 2: Implement automated mechanisms that terminate network connections associated with communications sessions at the end of the session or after a predefined period of inactivity. \n• Step 3: Test automated disconnect mechanisms regularly to verify they function properly and update them as necessary.\n• Step 4: Train employees on the importance of manually disconnecting from networks when their sessions are no longer active.",
  "SC-20": "• Install and configure a trusted DNS server to act as the authoritative source for your domain, ensuring all resolving names and addresses are securely managed.\n• Establish a routine for updating DNS records, ensuring the enforced security policies align with the NIST guidelines.\n• Implement DNSSEC to provide an authentication layer to your DNS queries, reducing the risk of spoofing and man-in-the-middle attacks.\n• Auditing DNS logs frequently to detect anomalies or suspicious activities. Take reactive measures promptly when necessary.",
  "SC-21": "- Install and configure a Certified DNS Recursive Resolver that is specifically built with security features against various types of attacks (like DNS spoofing).\n- Activate DNSSEC (Domain Name System Security Extensions) to provide authentication and integrity checks of DNS data.\n- Regularly update and patch your DNS Resolver to ensure security features are up-to-date.\n- Monitor the Resolver logs frequently to identify potential threats and carry out vulnerability assessments.",
  "SC-22": "• Review your current DNS architecture, looking for any risks or vulnerabilities. Pay specific attention to security aspects like access control, encryption, and pretexting measures.\n• Design or upgrade your DNS architecture ensuring separation of information based on sensitivity, unencrypted queries, or unauthorized modification.\n• Implement the improved DNS architecture. Regularly update system components to include latest security patches.\n• Continually monitor DNS traffic and logs for anomalies or potential indicators of compromise, using automated monitoring and manual review methods. Adjust security measures as needed.",
  "SC-23": "• Step 1: Implement secure session management that includes unique session identifiers for each session.\n• Step 2: Use advanced technologies for session identifiers, including encryption and dynamic regeneration.\n• Step 3: Adopt multi-factor authentication (MFA) to verify the user's session authenticity.\n• Step 4: Regularly review session management capabilities and procedures to identify and address any vulnerabilities. Add protections such as session timeout limits, revocations or IP lockdowns.",
  "SC-37": "• Identify and establish the necessary out-of-band channels that will help in your organization's security aspects. These may include backup communication systems or management interfaces.\n• Implement strong controls that exclude data leaks and ensure data from primary channels do not jump to out-of-band channels.\n• Regularly test the reliability and security of these established out-of-band channels.\n• Incorporate the use of encryption and strong authentication procedures to secure out-of-band channels communication.",
  "SA-10": "- Establish clear policies and procedures around configuration management, defining responsibilities for developers and detailing the process of updating and identifying system components.\n- Use version control systems for code repositories to track changes and facilitate traceability.\n- Implement automated tools that can enforce rules on configuration changes, detect unauthorized changes, and report differentials in configurations.\n- Regularly conduct audits to ensure compliance with the configuration management policies, correcting any deviations promptly.",
  "SA-11": "• Establish formal procedures for developers to test and evaluate all system components prior to integration.\n• Incorporate different testing methodologies including function testing, security testing, and penetration testing. \n• Ensure the evaluation process includes thorough vulnerability scanning and mitigation techniques. \n• Document the results from the developer testing and evaluations, use this data to improve future security controls and procedures.",
  "SA-15": "• Identify and document standards and tools used in system development and ensure they align with organization's cybersecurity objectives.\n• Enforce adherence to these development standards and tools through trainings and policy guidelines.\n• Regularly review and update the document considering the latest industrial trends and threat landscape.\n• Implement security testing of developed systems prior to mainstream adoption to ensure compliance with SA-15 control.",
  "SA-16": "• Identify and assess: Determine necessary security training based on roles and responsibilities, focusing on developers who create or modify the organization's system components.\n• Develop and deliver training: Developer training should cover secure coding practices, threat modeling, and security testing techniques. \n• Evaluate effectiveness: Post-training, assess the developers' understanding and application of security principles and revise training if necessary.\n• Document and update: Keep records of completed trainings, and align them with changes in system components, threats, or technologies.",
  "SA-17": "• Review and understand NIST SP 800-53 SA-17 guidelines thoroughly and the privacy aspects it encompasses.\n• Developers need to incorporate these guidelines into the architecture and design phase. This can be established through secure coding standards, API security protocols, and software architecture patterns.\n• Implement privacy-enhancing technologies such as anonymization techniques, data encryption, and pseudonymization.\n• Regular audits and assessments should be performed to ensure the compliance of software applications with NIST SP 800-53 SA-17 guideline.",
  "SA-03": "- First, define a system development life cycle (SDLC) for your organization, catering to your specific workflow and security requirements.\n- Incorporate NIST SP 800-53 controls into each phase of the SDLC, ensuring that security requirements are identified early and are continuously monitored.\n- Document processes and results at each phase of the SDLC for accountability, future reference, and easier return to previous phases if necessary.\n- Conduct regular reviews and updates of the SDLC, ensuring it remains effective and current with emerging security threats and requirements.",
  "SA-04": "• Define and establish an acquisition process aligned with organizational requirements and information security needs.\n• Utilize the acquisition process to evaluate and select the most secure and compliant products and services.\n• Include cybersecurity requirements in contracts and acquisition-related documentation to ensure contractual agreements enforce security controls.\n• Routinely evaluate and monitor the supplier's security controls and compliance status, updating the acquisition process as needed.",
  "IA-12": "• Step 1: Establish a standard procedure for validating identity proofing, ensuring that it aligns with NIST SP 800-63-3 guidance which provides a detailed explanation of identity assurance levels.\n• Step 2: Train your staff in the implemented procedure so they can accurately validate user identities before granting any access or credentials.\n• Step 3: Implement software that can automate the identity proofing process and ensure the proofing is properly recorded and documented.\n• Step 4: Regularly audit your systems and procedures to verify they are effective and compliant with the NIST guideline.",
  "SC-08": "- Step 1: Implement encryption technologies to secure data during transmission, ensuring the confidentiality and integrity of data. Use protocols such as Secure Socket Layer (SSL) or Transport Layer Security (TLS).\n- Step 2: Include authentication and verification methods for data transmission ensuring only authorized entities can access the transmitted data.\n- Step 3: Regularly update cryptographic keys to minimize risk of data exposure. \n- Step 4: Continuously monitor and log transmission activities to detect and respond to security incidents in real-time.",
  "IA-11": "• Step 1: Define a re-authentication policy specifying conditions when users must re-authenticate, such as after a certain time of inactivity or when trying to access sensitive information. \n• Step 2: Configure your security system or implement a tool to enforce the policy, automatically prompting users to re-enter credentials when required conditions are met.\n• Step 3: Implement multi-factor authentication for re-authentication to increase security level.\n• Step 4: Train users to understand the re-authentication process and its importance, and carry out regular audits to ensure compliance.",
  "AC-10": "• Step 1: Establish a policy for maximum concurrent sessions per user in your system in line with business requirements and performance considerations. \n• Step 2: Implement session control mechanisms, like limiting the number of simultaneous logins, using your security management tools.\n• Step 3: Deploy system software updates, patches, or firewall configurations to enforce the session control policy.\n• Step 4: Continually monitor session logs to detect unusual activity and adjust control settings as necessary.",
  "SC-44": "• Purchase or develop a detonation chamber software that automatically separates suspicious files for deeper scrutiny. \n• Incorporate the purchased or developed software into the system being protected. \n• Configure the software settings according to your specific security needs, ensuring any suspicious files are automatically quarantined.\n• Continuously monitor and update the software to ensure that it remains effective against new threats.",
  "SI-08": "• Deploy a robust spam filter at the mail gateway to block or filter out spam emails. Use filters that are updated regularly to keep up with evolving tactics used by spammers.\n• Regularly update all email software to ensure the latest protection measures are in place.\n• Implement user training on identifying and reporting potential spam or phishing attempts. \n• Monitor email traffic and analyze logs to identify any unusual activities, such as large spikes in incoming mails.",
  "AC-14": "• Identify all operations that will require activities or actions without user identification or authentication.\n• Document the necessary operations and ensure these operations are appropriately scoped to prevent unauthorized access or misuse.\n• Implement robust intrusion detection mechanisms to monitor these identified operations and actions.\n• Regularly review and update the scope of permitted actions to offer security against evolving threats.",
  "AC-12": "• Establish automatic session termination parameters, such as inactivity time limits, logout upon abnormal behavior, or set daily session limits.\n• Implement session termination upon certain actions, like network disconnection or system shutdown.\n• Install software that supports automatic session termination, ensuring it's correctly set up to match your organization's requirements.\n• Regularly audit, assess, and update control settings as required, to maintain optimization and effectiveness.",
  "CA-02": "- Step 1: Develop a schedule for regular control assessments that align with the risk tolerance of the organization.\n- Step 2: Identify and clearly articulate the scope and objectives of each control assessment, ensuring analysis against NIST SP 800-53 guidelines.\n- Step 3: Conduct the assessments, analyzing the effectiveness of each control, identifying vulnerabilities, and highlighting deviations from policies.\n- Step 4: Document findings and, based on these, develop an action plan for enhancing the controls or creating new ones.",
  "RA-10": "• Establish a dedicated threat hunting team or assign the responsibility to current staff or external service provider.\n• Implement advanced security information and event management (SIEM) software to automatically identify potential threats.\n• Regularly schedule intensive threat hunting activities to actively search and analyze system logs and behaviors across entire digital landscape.\n• Review and update your policy regularly to accommodate new types of vulnerabilities and to align with the updated threat landscape.",
  "SA-22": "• Inventory: Begin by creating a thorough inventory of all system components within your organization. This includes hardware, software, and firmware.\n\n• Assess Support Status: Evaluate the support status of each component, identifying those that are unsupported by suppliers. This could be due accessing end-of-life (EOL) or end-of-service (EOS) stages.\n\n• Develop Migration/Phase-out Plan: For each unsupported system component, develop a plan to migrate to supported versions or phase them out completely.\n\n• Adhere to NIST Guidelines: Throughout the process, carefully follow NIST SP 800-53 guidelines to ensure an optimal level of cybersecurity.",
  "IA-07": "• Select and acquire a certified cryptographic module that is FIPS 140-2 compliant, confirming that the module has been critically tested for security flaws.\n• Implement the cryptographic module within the system, ensuring its integration doesn't introduce vulnerabilities.\n• Configure each system user or process to authenticate via the cryptographic module before gaining access to the system.\n• Continually audit the module's usage to ensure its effectiveness and review for any potential security improvements.",
  "RA-09": "• Step 1: Identify all systems, components, or functions that are critical to your operation.\n• Step 2: Conduct an impact and consequence analysis to determine the potential effects of disruption or failure of the identified components.\n• Step 3: Prioritize and rank these components based on their criticality, taking risk tolerance into consideration.\n• Step 4: Update and review this criticality analysis regularly, preferably annually or whenever significant changes are made to the system or operational requirements.",
  "SC-34": "- Deploy digital signature techniques to authenticate executable programs and scripts, denying non-signed ones or those with invalidated signatures.\n- Configure system security settings to prevent unauthorized modification, shipment, or execution of executable programs.\n- Regularly review and update white-listed executables. Delete or quarantine programs not on the whitelist.\n- Implement real-time monitoring mechanisms to track changes in executable programs and send alerts for any unauthorized modifications.",
  "AC-08": "• Develop a standard, well-defined system use notification message that includes a policy defining proper system use and user responsibilities.\n• Implement a mechanism that automatically displays your system use notification (warnings, consent dialogs) before granting access to the system.\n• Ensure that your system logs and timestamps user acceptance of the system use notification to maintain a record for compliance and auditing purposes.\n• Regularly review and update your system use notification message to reflect any changes in policy or legal requirements.",
  "SC-02": "• Develop clear separations for system and user-level functionality in your software design. System operations should only be accessible by authorized administrators.\n• Implement strong role-based Access Control (RBAC) policies to grant permissions according to job function.\n• Use monitoring tools to log and audit actions performed under system-level functionality to detect any unauthorized access or misuse.\n• Periodically review and update system-user functionality separation based on changes in system operations and job roles.",
  "SC-29": "• Start by identifying the range of system components such as operating systems, applications, databases and networking gear.\n• Purchase these system components from diverse vendors to create a heterogeneous environment.\n• Regularly review the system environment to ensure continuous balance between systems purchased from different vendors.\n• Implement diverse defensive strategies like different antivirus vendors, firewalls, intrusion detection systems that match each unique component in the heterogeneous system.",
  "SC-30": "• Identify potential targets in your system that might tempt attackers and develop concealment strategies to hide these details.\n\n• Implement misdirection techniques such as honeypots to deceive potential attackers and distract them from actual assets.\n\n• Regularly update your concealment and misdirection measures to remain unpredictable to potential attackers.\n\n• Test these measures frequently to ensure effectiveness, making necessary adjustments based on these tests.",
  "SC-26": "• Step 1: Set up decoy systems or honeypots that simulate your organization's IT environment. These should be indistinguishable from real systems.\n• Step 2: Implement a tracking system within the decoys allowing detection and monitoring of any unauthorized access or suspicious activities. \n• Step 3: Develop real-time alerts to notify system administrators when unauthorized intrusions occur.\n• Step 4: Continually review and update the decoy systems to reflect changes in the actual IT environment, including software updates and configuration changes.",
  "SC-35": "• Deploy and maintain an antivirus software on all systems that accesses internet.\n• Regularly update the antivirus signatures to ensure it can identify the latest external malicious codes.\n• Incorporate continuous monitoring and automated alerts whenever a malicious code is detected.\n• Regularly scan external removable media (like USBs, external HDDs) for malicious software.\n• Train employees on safe browsing and email habits to prevent inadvertent introduction of malicious code.",
  "SI-05": "• Set up a process to regularly receive and review security alerts, advisories and directives from reliable sources such as NIST, CIS, and vendor advisories.\n• Integrate these alerts into system components and perform necessary system checks, software upgrades, or configuration changes in a timely manner.\n• Develop an emergency protocol to address any immediate threats detected. Prioritize response based on the severity of threats.\n• Document all actions, timelines, and decisions made in response to each alert, advisory, or directive for compliance and auditing purposes.",
  "AC-21": "- Develop a detailed information sharing policy following NIST SP 800-53 guidelines, clearly stating what information can be shared, and with whom.\n- Implement technical controls such as firewalls, access control lists, and encryption to ensure only authorized access to shareable information. \n- Regularly monitor and log activities related to information sharing, using intrusion detection systems or other tools.\n- Train all employees about the policy, including potential risks of improper sharing, and regularly review and update the policy.",
  "CP-10": "- Develop a comprehensive system recovery process that identifies steps to restore systems after a disruption or failure.\n- Regularly back up data and validate its integrity to ensure information is recoverable.\n- Provide training for key personnel on system recovery methodologies including data restoration.\n- Test recovery processes periodically to ensure effectiveness and modify strategies as needed. Integrate modifications from the test results into the formal procedure.",
  "CP-02": "• Develop a comprehensive contingency plan that details procedures for restoring systems following a disruption or disaster.\n• Test the plan regularly to ensure its effectiveness, modifying it according to results and technological changes.\n• Train all personnel on the application of the contingency plan to ensure their readiness in case of an incident.\n• Analyse and learn from each incident, improving the plan as needed. Maintain documentation for each update.",
  "SC-16": "• Step 1: Assess your data transmission mechanisms to verify they are capable of associating security and privacy labels with data.\n• Step 2: Configure your systems to embed these labels in transferred data or alongside as metadata, ensuring security and privacy attributes are transmitted together with the data. \n• Step 3: Implement measures, like encryption and secure protocols, to protect these attributes during transmission.\n• Step 4: Regularly review and update the security labels as well as the labeling and transmission mechanisms as per the evolving privacy and security regulations.",
  "SI-14": "- Install virtualization technology on all systems to create non-persistent environments that are reset after each session.\n- Implement a session timeout policy to automatically end user sessions after a specific duration of inactivity.\n- Develop a mechanism for regular updates and patches to be automatically installed upon system boot-up, ensuring each session begins with up-to-date protections.\n- Use encryption and strong authentication controls for all temporary session-related information, ensuring data protection.",
  "IA-03": "• Create an inventory of all devices that are connected to your network, including servers, workstations, laptops, and mobile devices.\n• Implement a device authentication system that ensures only authorized devices can connect to network resources. This could involve MAC address filtering or certificate-based authentication.\n• Continually monitor network traffic to identify unauthorized devices and set up alerts for any connection attempts from such devices.\n• Regularly review and update the device inventory and authentication policies to incorporate new devices and remove decommissioned ones.",
  "CM-10": "• Identify all software applications in your network and take a detailed inventory, including versions and update frequency.\n• Create a policy detailing permissible software and establish usage restrictions based on business necessity and security risks. This can be user-specific or department-specific.\n• Implement a system (like Application Control solutions) to enforce software usage restrictions, preventing unauthorized software from running.\n• Regularly update the software inventory and re-evaluate the software usage policy to adjust for new business needs and potential new security threats.",
  "SC-12": "• Step 1: Establish a centralized key management system following the guidelines of NIST SP 800-57. This will help to generate, distribute and store cryptographic keys securely.\n• Step 2: Generate strong cryptographic keys using a secure random number generator and ensure keys have appropriate length based on the cryptographic algorithm in use.\n• Step 3: Implement a key lifecycle management strategy to monitor key use, perform regular key rotation, revoke keys when required, and ensure secure key archival or destruction.\n• Step 4: Apply strong authentication methods and access controls to prevent unauthorized access to cryptographic keys.",
  "AC-11": "• Install automatic device-lock software on all system devices. Ensure that the settings are configured for automatic device lock after a predetermined period of inactivity.\n• Implement strong authentication methods such as biometrics, or multi-factor authentication, for unlocking devices.\n• Incorporate session lock controls into device policy and security awareness training.\n• Regularly evaluate and update device lock policies and settings as part of the organization's ongoing security program.",
  "SC-06": "• Step 1: Identify all systems and resources that require high availability to function effectively. This includes servers, databases, and networks.\n• Step 2: Install and maintain resources for system redundancy, such as RAID systems for storage or multiple internet connections.\n• Step 3: Configure systems to alert when resources are nearing capacity, and automate responses where possible.\n• Step 4: Regularly test system failovers to ensure above measures are functioning and adjust as necessary.",
  "SC-43": "- Identify all information systems that process, store, or transmit your organization's data.\n- Document and enforce restriction policies, clearly defining what operations each system user or process can perform based on their role/access level.\n- Implement mechanisms, such as a role-based access control system, to enforce the usage restrictions for each individual user or process on the system.\n- Regularly review and update these usage restriction settings as your organization's needs evolve or as experience shows the need for adjustment.",
  "SC-17": "- Acquire PKI certificates: Start by sourcing Public Key Infrastructure (PKI) certificates from a reputable Certificate Authority (CA).\n- Install and Configure: Install the PKI certificates on your network systems and configure them properly to authenticate and encrypt data communications.\n- Establish Policies: Create robust policies for issuance, renewal, revocation and destruction of PKI certificates.\n- Regular Auditing: Establish a routine process of auditing to assure proper use and validation of PKI certificates. Reporting any anomaly or breach immediately."
}